Repository: 84000/data-translation-memory
Catalog: toh266-v3.tmx
Source language: bo
Languages: en

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་གྲགས་པ་མཐའ་ཡས་དེའི་མཚན་གང་དག་ཉན་པ་དང་། ཐལ་མོ་སྦྱོར་ཞིང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གྲགས་པ་མཐའ་ཡས་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཏུ་སྨྲ་བ་དེ་དག་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of Infinite Renown and, with palms joined, say the words, ‘Homage to the thus-gone one, the worthy one, the completely perfect buddha Infinite Renown!’ will acquire a limitless heap of merit.

source: །རིན་པོ་ཆེའི་ཕུང་པོ་རི་རབ་དང་མཉམ་པ་ལོ་བརྒྱར་སྦྱིན་པ་བྱིན་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིས་སྔ་མ་དེའི་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་བ་ནས་རྒྱུའི་བར་དུ་ཡང་མི་བཟོད་དོ།
en: The heap of merit that comes from offering a heap of jewels equal in size to Mount Sumeru for a hundred years does not approach even a hundredth part of the former heap of merit, nor does it withstand analogy to it.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་གསུམ་ན་འཇིག་རྟེན་གྱི་ཁམས་མན་ཤེལ་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་སྣང་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Three thousand buddhafields from here, in the world system called Crystalline, dwells the thus-gone one, the worthy one, the completely perfect buddha called Bright Jewel.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་སྣང་འདིའི་མཚན་གང་དག་འཛིན་པ་དེ་དག་ནི་བསྐལ་པ་བཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: Śāriputra, those who uphold the name of Bright Jewel will turn away from saṃsāra in ten eons.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Furthermore, they will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །ཡང་གང་དག་དད་པར་མི་བྱེད་པ་དེ་དག་ནི་བསྐལ་པར་མཚམས་མེད་པར་གནས་པའི་ལས་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: However, those who lack faith will incur the karma of dwelling in the Hell of Endless Torment for an eon.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བཅྭ་ལྔ་ན་འཇིག་རྟེན་གྱི་ཁམས་འོད་གསལ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདེ་བ་ཆེན་པོ་ཐོབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Fifteen thousand buddhafields from here, in the world system called Luminosity , dwells the thus-gone one, the worthy one, the completely perfect buddha called Possessor of Great Bliss.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བདེ་བ་ཆེན་པོ་ཐོབ་པའི་མཚན་གང་དག་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་བདེ་བར་སྒྲོལ་བར་བྱེད་དོ།
en: Śāriputra, all those who hear the name of the thus-gone one Possessor of Great Bliss will liberate all beings into bliss.

source: །བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པ་ཡང་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: Furthermore, they will obtain a limitless heap of merit.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་བདུན་ན་འཇིག་རྟེན་གྱི་ཁམས་ནོར་བུ་སྣང་བ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་མ་མར་མེ་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Seven thousand buddhafields from here, in the world system called Shining Gem, dwells the thus-gone one, the worthy one, the completely perfect buddha called Shining Star Lamp.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་སྐར་མ་མར་མེ་སྣང་བ་དེའི་མཚན་གང་དག་ཉན་པ་དང་། དད་པར་གྱུར་པ་དེ་དག་གང་འདི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ཞེས་བྱ་བའི་སྟོབས་དེ་དག་རབ་ཏུ་འཛིན་པར་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one Shining Star Lamp and have faith will acquire the powers called the powers of a thus-gone one

source: །འདི་ནས་སངས་རྒྱས་ཞིང་སྟོང་ཕྲག་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་བདེ་ལྡན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་བདེན་པའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eight thousand buddhafields from here, in the world system called Truthful, dwells the thus-gone one, the worthy one, the completely perfect buddha called Melody of Truth.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བདེན་པའི་དབྱངས་དེའི་མཚན་གང་དག་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Melody of Truth will attain unexcelled, perfect and complete awakening.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་ཉི་ཤུ་ན་འཇིག་རྟེན་གྱི་ཁམས་གསེར་ཅན་ཞེས་བྱ་བ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མེད་མཐའ་ཡས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two thousand buddhafields from here, in the world system called Golden, dwells the thus-gone one, the worthy one, the completely perfect buddha called Infinite Purity.

source: ཡང་ཤཱ་རིའི་བུ་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེ་སྦྱིན་པ་བྱིན་པ་བས། དེ་བཞིན་གཤེགས་པ་དྲི་མེད་མཐའ་ཡས་ཀྱི་མཚན་ཉན་ཅིང་དད་པ་ཡང་སྐྱེད་པར་འགྱུར་བ་དེ་དག་ནི་དེ་བས་ཆེས་བསོད་ནམས་འདི་མང་དུ་འཕེལ་ལོ།
en: Śāriputra, the merit generated by hearing the name of the thus-gone one Infinite Purity and also giving rise to faith far exceeds the merit that comes from offering the trigalactic megagalactic world system completely filled with the seven kinds of precious substances.

source: །བསོད་ནམས་ཆུང་ངུས་ནི་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་མཐའ་ཡས་ཀྱི་མཚན་ཐོས་པར་མི་ནུས་སོ།
en: With little merit, one cannot hear the name of the thus-gone one Infinite Purity.

source: །གང་དག་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་མཐའ་ཡས་ཀྱི་མཚན་ཐོས་པ་དེ་དག་ནི་སངས་རྒྱས་གཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་མ་ཡིན། གཉིས་དང་གསུམ་དང་བཞི་དང་ལྔ་ནས་བཅུའི་བར་དུ་མ་ཡིན་གྱི་སེམས་ཅན་དེ་དག་གིས་ནི་སངས་རྒྱས་བརྒྱ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཡིན་ནོ།
en: Those who hear the name of the thus-gone one Infinite Purity have not produced roots of virtue with respect to just one buddha. Nor have they produced roots of virtue with respect to just two, three, four, five, or up to ten buddhas. Rather, those beings have produced roots of virtue with respect to a hundred buddhas.

source: །དེ་དག་ནི་བསྐལ་པ་ལྔ་བཅུ་རྩ་བརྒྱད་ཀྱི་བར་དུ་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: They will turn away from saṃsāra in fifty-eight eons.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་དགུ་ན་འཇིག་རྟེན་གྱི་ཁམས་དབྱངས་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་བ་ལྟར་དཀར་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Nine thousand buddhafields from here, in the world system called Melodious , dwells the thus-gone one, the worthy one, the completely perfect buddha called White as the Moon.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ལྟར་དཀར་བའི་མཚན་གང་དག་ཉན་པ་དེ་དག་ཐམས་ཅད་ཀྱི་ཆོས་དཀར་པོ་ཡང་ཟླ་བ་ལྟ་བུར་འགྱུར་ཞིང་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Śāriputra, the virtuous qualities of all those who hear the name of the thus-gone one White as the Moon will wax like the moon. They will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་གི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཉི་མ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཟླ་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “A thousand buddhafields beyond here, in the world system called Possessing Sun, dwells the thus-gone one, the worthy one, the completely perfect buddha called Moonlight.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་ཀྱི་མཚན་གང་དག་ཉན་ཅིང་ཐོས་ནས་ཀྱང་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་འོད་དེ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཆེད་དུ་བརྗོད་པ་ལན་གསུམ་དུ་བརྗོད་པ་དང་། ཡང་གང་དག་གིས་ཆེད་དུ་བརྗོད་པར་བྱ་བ་རྗོད་པར་བྱེད་ན་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: Śāriputra, those who hear the name of the thus-gone one Moonlight and, having heard it, kneel on their right knees and joyously proclaim three times, ‘Homage to the thus-gone one Moonlight!’ will, upon making such a joyful proclamation, swiftly arrive at unexcelled, perfect and complete awakening.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་སུམ་ཅུ་ན་འཇིག་རྟེན་གྱི་ཁམས་དྲི་མ་མེད་པ་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “Thirty thousand buddhafields from here, in the world system called Stainless , dwells the thus-gone one, the worthy one, the completely perfect buddha called Stainless Light.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པའི་འོད་ཀྱི་མཚན་ལྷའམ་ཀླུའམ་མི་གང་དག་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Stainless Light, be they gods, nāgas, or humans, will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །དེ་དག་ལོག་པར་ལྟུང་བའི་འཇིགས་པའང་དོགས་པར་མི་བྱའོ།
en: They should not be frightened or worried about falling into ruin.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ཉིས་སྟོང་ལྔ་བརྒྱ་ན་འཇིག་རྟེན་གྱི་ཁམས་བཻ་དཱུརྱའི་སྣང་བ་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དག་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two thousand five hundred buddhafields from here, in the world system called Shining with Beryl, dwells the thus-gone one, the worthy one, the completely perfect buddha called Pristine Light.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་འོད་དག་པའི་མཚན་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། མི་འམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ།
en: Śāriputra, all those who hear the name of the thus-gone one Pristine Light, be they gods, nāgas, yakṣas, gandharvas, kinnaras, mahoragas, humans, or nonhumans, will obtain a human existence.

source: མིའམ། མི་མ་ཡིན་པ་གང་དག་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་མིར་འགྱུར་བ་འཐོབ་པར་འགྱུར་རོ། །འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་ཀྱང་ཡོངས་སུ་སྤྱོད་པར་བྱེད་དོ། །ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་འོད་དག་པ་དེའི་མཚན་ཐོས་པ་དད་ལྡན་པའི་དགེ་བའི་རྩ་བ་ལ་དེ་དག་དད་པར་མི་བྱེད་ཅིང་ཡིད་མ་ཆེས་པ་ལས་བྱུང་བ་མི་དགེ་བའི་ལས་ཀྱིས་དེ་ལྟ་བུར་ག་ལ་འགྱུར་ཞེས་ཚིག་ཏུའང་སྨྲས་ན། ལོ་སྟོང་ཕྲག་དྲུག་ཅུར་དམྱལ་བ་ཆེན་པོ་འོ་དོད་འབོད་པ་ཞེས་བྱ་བར་བཙོ་བར་འགྱུར་རོ།
en: Their desire, hatred, and ignorance will also be purified. Śāriputra, if those who, through the nonvirtuous karma of not having faith or confidence in the virtuous roots of the faithful that have heard the name of that thus-gone one, so much as say, ‘How could such things come about?’ they will roast in the terrible hell called Howling for sixty thousand years.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྲིད་ན་འཇིག་རྟེན་གྱི་ཁམས་ལེགས་པར་ཐོབ་པ་དང་ལྡན་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཉི་འོད་ཅེས་བྱ་བ་བཞུགས་ཏེ།
en: “A hundred buddhafields away from here, in the world system called Endowed with Excellent Attainment, dwells the thus-gone one, the worthy one, the completely perfect buddha called Sunlight.

source: ཡང་ཤཱ་རིའི་བུ་གང་དག་དེ་བཞིན་གཤེགས་པ་ཉི་འོད་ལ་རྗེས་སུ་དྲན་པར་བྱེད་ན་དེ་དག་ཐམས་ཅད་ཀྱི་ཆོས་དཀར་པོ་ཉི་མའི་དཀྱིལ་འཁོར་ལྟ་བུར་འགྱུར་རོ།
en: Śāriputra, the virtuous qualities of all those who remember the name of the thus-gone one Sunlight will be like the orb of the sun.

source: །བདུད་ཀྱི་སྡེ་ཐམས་ཅད་ཀྱང་རྣམ་པར་འཇིག་པར་བྱེད་དོ། །མུ་སྟེགས་གཞན་ཡང་ཕམ་པར་བྱེད་དོ།
en: They will destroy all the hordes of demons and vanquish non-Buddhists.

source: །བསྐལ་པ་སུམ་ཅུར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་འགྱུར་རོ།
en: In thirty eons they will turn way from saṃsāra.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་སྟོང་ཕྲག་དྲུག་ཅུ་བས་ཆེས་རིང་བ་འཇིག་རྟེན་གྱི་ཁམས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རབ་ཏུ་བརྒྱན་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་ཆེན་མཐའ་ཡས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Far beyond sixty thousand buddhafields from here, in the world system called Well Adorned with the Factors Conducive to Awakening, dwells the thus-gone one, the worthy one, the completely perfect buddha called Infinite Jewel.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཐའ་ཡས་ཀྱི་མཚན་གང་དག་ཉན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཡན་ལག་འཐོབ་པར་འགྱུར་རོ།
en: Śāriputra, all of those who hear the name of the thus-gone one Infinite Jewel will attain the factors of awakening.

source: །སེམས་ཅན་ཡང་དཀོན་མཆོག་དམ་པ་ལ་འགོད་པར་བྱེད་དོ།
en: Furthermore, they will establish beings in the sublime Jewels.

source: །དེ་དག་ཉིན་མཚན་དུ་ཡང་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་པར་འགྱུར་རོ།
en: Day and night, they will acquire immeasurable heaps of merit.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་ལྔ་བརྒྱ་སྙེད་ན་འཇིག་རྟེན་གྱི་ཁམས་པད་མོ་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པད་མོའི་བླ་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Five hundred buddhafields from here, in the world system called Endowed with Lotuses, dwells the thus-gone one, the worthy one, the completely perfect buddha called Lotus Guru.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་པད་མོའི་བླ་མའི་མཚན་གང་དག་ཉན་པ་དང་། དད་པ་ཡང་སྐྱེད་ནི་འཇིག་རྟེན་ན་དེ་དག་ཐམས་ཅད་པད་མོ་དང་འདྲ་བར་འགྱུར་ཏེ།
en: Śāriputra, those who hear the name of the thus-gone one Lotus Guru and give rise to faith will all be like lotuses in the world;

source: དགེ་བའི་ཆོས་ཀྱིས་མངོན་པར་འཕགས་པར་འགྱུར་རོ།
en: they will be exalted in virtuous qualities.

source: །པད་མོ་ཆུའི་ནང་ནས་སྐྱེས་ཀྱང་ཆུ་མི་ཆགས་པ་བཞིན་དུ་བསྐལ་པ་ལྔ་བཅུ་རྩ་ལྔར་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: Just as a lotus grows from water but is not mired in it, they will turn away from saṃsāra in fifty-five eons.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་བས་ཆེས་རིང་བ་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་དང་གནོད་པ་ཐམས་ཅད་ལས་འདས་པ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡན་ལག་བླ་མ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Far beyond one trillion buddhafields from here, in the world system called Beyond All Sorrow and Harm, dwells the thus-gone one, the worthy one, the completely perfect buddha called Branch Guru.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཡན་ལག་བླ་མའི་མཚན་གང་དག་ཉན་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྲེད་པའི་ཆུའི་རྒྱ་མཚོ་ཆེན་པོ་ལས་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་དང་གནོད་པ་ཐམས་ཅད་ལས་སྒྲོལ་བ་ཞེས་བྱ་བར་སྒྲོལ་བར་བྱེད་དོ།
en: Śāriputra, all those who hear the name of the thus-gone one Branch Guru will be ferried across the great ocean of the waters of existence to the world system called Liberation from All Sorrow and Harm.

source: །འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སྦྱིན་གནས་སུ་ཡང་འགྱུར་རོ།
en: They will become worthy of veneration in all worlds.

source: །གང་དག་ཐོས་ནས་དད་པ་སྐྱེད་པ་དེ་དག་ཐམས་ཅད་མེ་ཏོག་དང་འདྲ་བར་གྱུར་ཏེ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་སློབ་དཔོན་དུ་འགྱུར་རོ། །མཐུ་བོ་ཆེའི་ལུས་ལྟར་མཁྲེགས་པར་འགྱུར་རོ།
en: All those who hear the name and give rise to faith will become like flowers, serving as teachers in all worlds.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཀྱང་ཕྱིར་ལྡོག་པར་མི་འགྱུར་རོ།
en: They will become as firm as the body of Nārāyaṇa and they will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །ཡང་བུད་མེད་གང་དག་དེ་བཞིན་གཤེགས་པ་ཡན་ལག་བླ་མའི་མཚན་ཉན་ཅིང་ཐོས་ནས་ཀྱང་དད་པ་སྐྱེད་པ་ནི་དེས་བུད་མེད་ལས་བསྒྱུར་བར་འགྱུར་རོ།
en: Moreover, any woman who hears the name of the thus-gone one Branch Guru and, having heard it, gives rise to faith, will thus be transformed from being a woman.

source: །ཤཱ་རིའི་བུ་དེ་བས་ན་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཕན་ཡོན་འདི་དག་འདོད་པ་དང་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་དགྲོལ་བར་བྱ་བའི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བྱ་ན། དེ་བཞིན་གཤེགས་པ་ཡན་ལག་གི་བླ་མའི་མཚན་མཉན་པར་བྱའོ།
en: Śāriputra, for that reason, if a son or daughter of noble family were to desire these benefits and give rise to the resolve set on unexcelled, perfect and complete awakening in order to liberate suffering beings, then he or she should hear the name of the thus-gone one Branch Guru.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་ཉི་ཤུ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྙིང་པོ་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་འོད་དམ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two thousand buddhafields from here, in the world system called Replete, dwells the thus-gone one, the worthy one, the completely perfect buddha called Sublime Golden Light.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་གསེར་འོད་དམ་པའི་མཚན་གང་དག་ཉན་ཅིང་ཐོས་ནས་ཀྱང་དད་པ་སྐྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་འོད་འཐོབ་པར་འགྱུར་ཏེ།
en: Śāriputra, all those who hear the name of Thus-Gone One Sublime Golden Light and, having heard it, give rise to faith, will obtain illumination.

source: གང་འདི་སངས་རྒྱས་ཀྱི་འོད་དང་སྟོབས་རྣམས་ཀྱང་རབ་ཏུ་འཛིན་པར་འགྱུར་རོ།
en: For they will acquire the light and power of the buddhas.

source: །མི་འཇིགས་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཕན་ཡོན་རྣམས་ཀྱང་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ།
en: They will also obtain the varieties of fearlessness and the beneficial qualities of the buddhas.

source: །སངས་རྒྱས་ཐམས་ཅད་ལ་དད་པར་བྱ་བ་དང་། བསོད་ནམས་རྒྱ་ཆེན་པོ་ཡང་བྱའོ།
en: They will cause others to have faith in all buddhas and produce immense merit.

source: །བསོད་ནམས་ཆུང་དུས་ནི་འདི་ལ་རེ་བར་མི་བྱ་སྟེ།
en: Those whose merit is meager should not expect all that.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་འདི་འདྲ་བས་རྡོ་རྗེ་ལྟ་བུའི་སེམས་བསྐྱེད་ནས་བྱང་ཆུབ་པར་བྱ་བའི་ཕྱིར་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེད་པར་བྱེད་པ་ནི་མཚན་འདི་ཐོས་པར་མི་དཀའོ།
en: Hearing this name is not difficult for those who, through this kind of teaching of the thus-gone ones, have given rise to a vajra-like resolve and thus inspire others to give rise to the resolve for awakening in order to have them attain awakening.

source: །བསྐལ་པ་བཅུ་གཉིས་སུ་འཁོར་བ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་བྱས་པར་འགྱུར་རོ།
en: In twelve eons, they will turn away from saṃsāra.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བཅོ་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་མུ་ཏིག་གི་དྲ་བ་ཡོངས་སུ་དག་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཚངས་པའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighteen buddhafields from here, in the world system called Pristine Pearl Lattice, dwells the thus-gone one, the worthy one, the completely perfect buddha called Sovereign King of Brahmā.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཚངས་པའི་དབང་ཕྱུག་རྒྱལ་པོའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་ཞིང་ཐོས་ནས་ཀྱང་དད་པ་རབ་ཏུ་འཐོབ་པ་དང་། ཐལ་མོ་སྦྱར་བར་བྱེད་པ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དང་འབྲལ་བར་མི་འགྱུར་ཞིང་དེ་ནས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བྱེད་པར་འགྱུར་ཏེ།
en: Śāriputra, all those who hear the name of the thus-gone one Sovereign King of Brahmā and, having heard it, acquire faith and join their palms, will never part from that thus-gone one and will be universal monarchs in that realm.

source: ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: All of them will make irreversible progress toward unexcelled, perfect and complete awakening.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་ཕྲག་ཉི་ཤུ་ན་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ཅན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་ལྟར་སྣང་བ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Two thousand buddhafields from here, in the world system called Endowed with Moon, dwells the thus-gone one, the worthy one, the completely perfect buddha called Shining Like Gold.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་གསེར་ལྟར་སྣང་བའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཐ་ན་རྨི་ལམ་ན་ཡང་ཆོས་ཀྱི་རང་བཞིན་མིག་ཡོར་དང་འདྲ་བར་རྒྱ་ཆེར་སྟོན་པར་འགྱུར་རོ།
en: Śāriputra, all those who hear the name of the thus-gone one Shining Like Gold will be taught extensively, even in their dreams, that the nature of phenomena is like a hallucination.

source: །ལོག་པར་ལྟུང་བར་ཡང་མི་འགྱུར་ཏེ། བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་རོ།
en: They will also not fall into ruin, for they will acquire a great heap of merit.

source: །སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཡང་བདེ་བ་དང་ཡིད་བདེ་བར་བྱེད་པར་འགྱུར།
en: They will bring pleasure and happiness to an immeasurable number of beings.

source: འཇིག་རྟེན་འཛིན་པར་བྱེད། ཐེག་པ་ཆེན་པོས་ཀྱང་ངེས་པར་འབྱུང་བར་འགྱུར་རོ།
en: They will rule the world and reach perfection through the Great Vehicle.

source: །སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་ཐ་མ་ན་འཇིག་རྟེན་གྱི་ཁམས་མེ་སྒྲོན་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་གྱི་འབྱུང་གནས་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Ten buddhafields away, in the world system called Meteor, dwells the thus-gone one, the worthy one, the completely perfect buddha called Source of Gold.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་གསེར་གྱི་འབྱུང་གནས་ཀྱིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་གང་དག་སྐྱེ་བར་འགྱུར་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་གི་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་པར་གྱུར་པ་དེ་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ་བའི་ཕྱིར། དེ་ལྟར་བདག་གིས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱའོ་ཞེས་དེ་སྙམ་དུ་བསམས་སོ།
en: Śāriputra, previously the thus-gone one Source of Gold, while engaging in the conduct of the bodhisattvas, thought, ‘I shall perfect all the qualities of a buddha, so that all beings that will be born in the buddhafield where I awaken to unexcelled, perfect and complete awakening, and all beings from other world systems will, upon hearing my name, make irreversible progress toward unexcelled, perfect and complete awakening!’

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བཅྭ་བརྒྱད་ན་འཇིག་རྟེན་གྱི་ཁམས་སྦྲང་རྩི་ཅན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀླུའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Eighteen buddhafields from here, in the world system called Endowed with Honey dwells the thus-gone one, the worthy one, the completely perfect buddha called Sovereign King of Nāgas.

source: ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ཀླུའི་དབང་ཕྱུག་རྒྱལ་པོ་དེའི་མཚན་གང་དག་ཐོས་པར་འགྱུར་བ་ནི་ཀླུ་རྣམས་ཀྱིས་གང་གི་ཚེ་ན། གྲོང་ངམ་ཕྱོགས་སུ་ལྕེ་འབབ་པ་དེའི་ཚེ་ན། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་འདི་སྐད་དུ་སྨྲ་བར་བྱའོ། །བདེན་པ་གང་དང་བདེན་པའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཀླུའི་དབང་ཕྱུག་རྒྱལ་པོས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་ཀླུར་གྱུར་པས། གང་ཀླུ་རྣམས་ཀྱི་ཉམ་ང་བ་ལས་བྱུང་བ་དེ་དང་དེ་ལས་ཐར་པར་བྱས།
en: “Śāriputra, when the nāgas cast lightning bolts toward their village or region, those who hear the name of the thus-gone one Sovereign King of Nāgas should kneel on their right knees and say, ‘By the truth and true words, the thus-gone one Sovereign King of Nāgas became a nāga while previously engaged in the conduct of the bodhisattvas and liberated nāgas from each of their agonies.

source: ཀླུ་མང་པོ་དང་། ཀླུ་མང་པོ་བརྒྱ་དང་། ཀླུ་མང་པོ་སྟོང་དང་། ཀླུ་མང་པོ་བརྒྱ་སྟོང་རྣམས་ཉམ་ང་བ་ལས་ཐར་པར་བྱས་པས།
en: Because he liberated several hundreds, thousands, and hundreds of thousands of nāgas from agony, he made the following aspiration:

source: དགེ་བའི་རྩ་བ་འདིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་གནས་པའམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་གཞན་དག་ཏུ་ཡང་ཀླུ་གང་དང་གང་དག་གིས་ལྕེ་འབེབས་པའམ། གནོད་པའི་སེར་བ་འབེབས་པར་འགྱུར་བའམ། འཇིགས་པའམ། ནད་དམ། གནོད་པའམ། ནད་འགོ་བ་གཏོང་བ་དེར་བདག་གི་མིང་བརྗོད་ན་གནོད་པ་དེ་དག་ཐམས་ཅད་མེད་པར་གྱུར་ཅིག །བདེན་པའི་ཚིག་དེས་བདེ་བར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་སྟེ།
en: “By these virtuous roots may I perfectly awaken to unexcelled, perfect and complete awakening, such that uttering my name, whether I am still alive or have passed beyond suffering, may prevent harm and bring, through that word of truth, well-being wherever nāgas should cast lightning bolts or harmful hail, or spread peril, illness, harm, or contagion, even if it takes place in other world systems!”

source: ཤཱ་རིའི་བུ་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་སེམས་ཅན་དེ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་བདེ་བ་ལ་གཞག་གོ།
en: “Śāriputra, through the truth and those true words, even the retribution of these beings was directed toward happiness.

source: །ཀླུ་རྣམས་ལྕེ་གཏོང་བ་ཡང་མཚན་བརྗོད་པ་ཙམ་གྱིས་མེད་པར་འགྱུར་ཏེ།
en: The mere utterance of the name will prevent nāgas from sending lightning bolts.

source: ཀླུའི་སྐྱེ་གནས་དེ་ལས་ཤི་འཕོས་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་འགྱུར་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: For when they die, they will be reborn in his buddhafield and make irreversible progress toward unexcelled, perfect and complete awakening.

source: །གང་དག་ཡང་མོས་པ་དང་མངོན་པར་དད་པར་བྱེད་པ་དེ་དག་ཀྱང་ཉིན་མཚན་དུ་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པར་འགྱུར་རོ།
en: Moreover, those who have devotion and faith will acquire, day and night, an immeasurable heap of merit.

source: །དེ་དག་ལ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་རྙེད་དཀའ་བ་མ་ཡིན་ནོ།
en: It will not be difficult for them to acquire the wisdom of the buddhas.

source: །འདི་ནས་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་གི་ཕ་རོལ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བ་ལྟ་བུ་ཞེས་བྱ་བ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མེ་ཏོག་ཐམས་ཅད་ཀྱི་དྲིའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “A trillion buddhafields beyond here, in the world system called Moon-like , dwells the thus-gone one, the worthy one, the completely perfect buddha called Sovereign King of All Flowers’ Fragrance.
